#include <iostream>
using namespace std;
int main()
{
    setlocale(0, "Russian");
    int a;
    cout << "А ебу и не потею, некрасив, не худею\nСтоит только выпить чаю, я на бабе не кончаю\nИ при ебли я пою про истоооорию свою\nА на хую растёт акация\nДля мандавошек станция\nИ вся залупа синя-я-я-я\nИ по ней проходит линия\nА на жопе тёмный лес\nЧтоб чужой кто не залез\nА этот лес...\nА я не пью и не курю, чина за щеку даю.\nНе люблю кто матерится\nВсё ебу, что шевелится\nА ебу я без тонца\nДо побеееедного конца!\nА на хую растёт акация\nДля мандавошек станция\nИ вся залупа синя-я-я-я\nИ по ней проходит линия\nА на жопе тёмный лес\nЧтоб чужой кто не залез\nА этот лес...\nА я мастую как паяю\nОтъебу как расстреляю\nИ многие козлы не врут что подо мною кони врут\nА хуй мой ведь из каучука как башка\nУ чингачгука\nА на хую растёт акация\nДля мандавошек станция\nИ вся залупа синя-я-я-я\nИ по ней проходит линия\nА на жопе тёмный лес\nЧтоб чужой кто не залез\nА этот лес...\n";
    cin >> a;
}